PPTC_DOE_portable/run/template/system/controlDict.tmpl
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application simpleFoam; startFrom latestTime; startTime 0; stopAt endTime; endTime @ENDTIME@; deltaT 1;
writeControl timeStep; writeInterval @ENDTIME@; purgeWrite 1; writeFormat binary; writePrecision 8; writeCompression off;
timeFormat general; timePrecision 6; runTimeModifiable true;
functions
{
    forces { type forces; libs (forces); writeControl timeStep; writeInterval 5; patches (propeller); rho rhoInf; rhoInf 998.99; CofR (0 0 0); log false; }
    yPlus { type yPlus; libs (fieldFunctionObjects); writeControl writeTime; log true; }
    wallShearStress { type wallShearStress; libs (fieldFunctionObjects); patches (propeller); writeControl writeTime; log false; }
    residuals { type solverInfo; libs (utilityFunctionObjects); fields (U p k omega); writeResidualFields no; }
}
