PPTC_DOE_portable/run/template/0.orig/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

// omega = sqrt(k)/(Cmu^0.25 * l), l = 0.07*D, D = 0.25 m.

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2.562;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           uniform 2.562;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 2.562;
        value           uniform 2.562;
    }
    farfield
    {
        type            slip;
    }
    propeller
    {
        type            omegaWallFunction;
        value           uniform 2.562;
    }
}
