PPTC_DOE_portable/run/template/system/decomposeParDict.tmpl
FoamFile { version 2.0; format ascii; class dictionary; object decomposeParDict; }
numberOfSubdomains @NP@;
method scotch;
